src/Documents/ПеремещениеДенежныхСредств/ПеремещениеДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеДенежныхСредств</name>
  <registerRecords>AccumulationRegister.ОстаткиПланируемыхПокупок</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиПоСчетам</registerRecords>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <registerRecords>AccumulationRegister.Доходы</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиВалют</registerRecords>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетНазначения</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаНазначения</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНазначения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяПокупка</name>
    <type>
      <types>CatalogRef.ПланируемыеПокупки</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсДействуетДляИсходнойВалюты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументКомиссии</name>
    <type>
      <types>DocumentRef.РасходДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьВРасходах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьВДоходах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранзакцияПрихода</name>
    <type>
      <types>DocumentRef.БанковскаяТранзакция</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранзакцияРасхода</name>
    <type>
      <types>DocumentRef.БанковскаяТранзакция</types>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/ОстаткиВалют/ОстаткиВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиВалют</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУчетная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВзвешенныйКурс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчетныйКурс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ПеремещениеДенежныхСредств/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ДокументКомиссии) Тогда
	     ДокументКомиссииОбъект = ДокументКомиссии.ПолучитьОбъект();
		 ДокументКомиссииОбъект.Записать(РежимЗаписи, РежимПроведения);
	 КонецЕсли;
	 
	Дата = НачалоДня(Дата);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	//Если КурсДействуетДляИсходнойВалюты Тогда
	//	ПересчитаннаяСумма = Сумма / Курс * Кратность;
	//Иначе
	//	ПересчитаннаяСумма = Сумма * Курс / Кратность;
	//КонецЕсли;
	
	// движения по регистру "Остатки по счетам"
	ДвижениеРасход = Движения.ОстаткиПоСчетам.ДобавитьРасход();
	ЗаполнитьЗначенияСвойств(ДвижениеРасход, Ссылка);
	ДвижениеРасход.Сумма 	= Сумма;
	ДвижениеРасход.Период 	= Дата;
	
	ДвижениеПриход = Движения.ОстаткиПоСчетам.ДобавитьПриход();
	ДвижениеПриход.Период 	= Дата;
	ДвижениеПриход.Счет 	= СчетНазначения;
	ДвижениеПриход.Валюта 	= ВалютаНазначения;
	ДвижениеПриход.Сумма 	= СуммаНазначения;
		
	Если Валюта <> ВалютаНазначения Тогда
	
		РегистрыНакопления.ОстаткиВалют.ОтразитьСписаниеВалюты(ЭтотОбъект);
		РегистрыНакопления.ОстаткиВалют.ОтразитьПоступлениеВалюты(ЭтотОбъект);
	
	КонецЕсли;
	
	Если УчитыватьВРасходах Тогда
		
		ДвижениеРасходы = Движения.Расходы.Добавить();
		ДвижениеРасходы.Период 		= Дата;
		ЗаполнитьЗначенияСвойств(ДвижениеРасходы, Ссылка);
		
		Если Валюта <> ОбщийПовтИсп.ОсновнаяВалютаУчета() Тогда
			ДвижениеРасходы.СуммаУчетн = РегистрыНакопления.ОстаткиВалют.ПолучитьУчетнуюСуммуИзНабораЗаписей(Движения.ОстаткиВалют,
																						ВидДвиженияНакопления.Расход);	
		Иначе
			ДвижениеРасходы.СуммаУчетн = Сумма;
		КонецЕсли;																					
		
	КонецЕсли;	
	
	Если УчитыватьВДоходах Тогда
		
		ДвижениеДоходы = Движения.Доходы.Добавить();
		ДвижениеДоходы.Период 		= Дата;
		ДвижениеДоходы.Валюта 		= ВалютаНазначения;
		ДвижениеДоходы.СтатьяДДС 	= СтатьяДДС;
		ДвижениеДоходы.Сумма 		= СуммаНазначения;
		
		Если ВалютаНазначения <> ОбщийПовтИсп.ОсновнаяВалютаУчета() Тогда
			
			ДвижениеДоходы.СуммаУчетн 	= РегистрыНакопления.ОстаткиВалют.ПолучитьУчетнуюСуммуИзНабораЗаписей(Движения.ОстаткиВалют,
																						ВидДвиженияНакопления.Приход);
																						
		Иначе
			ДвижениеДоходы.СуммаУчетн = СуммаНазначения;
		КонецЕсли;
		
	КонецЕсли;
	
	// движения по регистру "Планируемые покупки"
	Если ЗначениеЗаполнено(ПланируемаяПокупка) Тогда
		
		ДвижениеПП = Движения.ОстаткиПланируемыхПокупок.ДобавитьРасход();
		ДвижениеПП.Период 	= Дата;
		ДвижениеПП.ПланируемаяПокупка = ПланируемаяПокупка;
		
		Если Валюта <> ОбщийПовтИсп.ОсновнаяВалютаУчета() Тогда
			ДвижениеПП.Сумма = РегистрыНакопления.ОстаткиВалют.ПолучитьУчетнуюСуммуИзНабораЗаписей(Движения.ОстаткиВалют,
																						ВидДвиженияНакопления.Расход);	
		Иначе
			ДвижениеПП.Сумма = Сумма;
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	

	// если распроводим документ перемещения, то принудительно распроводим документ комиссии
	Если ЗначениеЗаполнено(ДокументКомиссии) И ДокументКомиссии.Проведен Тогда
		
		ДокументКомиссииОбъект = ДокументКомиссии.ПолучитьОбъект();
		ДокументКомиссииОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
